#+title: First Article SotA
#+author: Maxime Gaide

#+TBLNAME: papers
#+STARTUP: shrink
|----+------------------------------------------------------------------------------------------------------------+----------------+------|
|    | title                                                                                                      | first author   | year |
|    |                                                                                                            |                |      |
|----+------------------------------------------------------------------------------------------------------------+----------------+------|
|  1 | Topological models for boundary representation: a comparison with n-dimensional generalized maps           | Lienhardt      | 1991 |
|  2 | N-dimensional generalized combinatorial maps and cellular quasi-manifolds                                  | Lienhardt      | 1994 |
|  3 | Identification of topological entities and naming mapping for parametric cad model exchange                | Mun            | 2005 |
|  4 | Generic computation of bulletin boards into geometric kernels                                              | Baba-Ali       | 2007 |
|  5 | Adaptation of CAD model topology for finite element analysis                                               | Foucault G.    | 2008 |
|  6 | Tracking topological changes in parametric models                                                          | Van der Meiden | 2010 |
|  7 | Name matching method using topology merging and splitting history for exchange of feature-based CAD models | SU Cheon       | 2012 |
|  8 | Using Maptrees to Characterize Topological Change (Thèse)                                                  | Worboys        | 2013 |
|  9 | Graph transformation library for topology-based geometric modeling                                         | Belhaouari     | 2014 |
| 10 | Using virtual topology operations to generate analysis topology.                                           | CM Tierney     | 2017 |
| 11 | Persistent naming based on graph transformation rules to reevaluate parametric specification               | Cardot         | 2019 |
| 12 | Push-Pull Direct Modeling of Solid CAD Models                                                              | Qiang Zou      | 2019 |
| 13 | Transparent Parallelization of Enrichment Operations in Geometric Modeling                                 | Bourquat       | 2020 |
| 14 | Inferring topological operations on generalized maps: Application to subdivision schemes                   | Pascual        | 2022 |
|----+------------------------------------------------------------------------------------------------------------+----------------+------|
#+TBLFM: $1=(@#-2)

* Name matching method using topology merging and splitting history for exchange of feature-based CAD models
** keywords
- Feature-based CAD model exchange
- Name matching
- Persistent naming
- Topology merging and splitting history
** Contribution
"The proposed name matching method is based on the local matching technique
using topology merging and splitting history."

* Tracking topological changes in parametric models
** keywords
- CAD
- Parametric modelling
- Families of objects
- Topology
- Constraint solving
** Contribution
System of constraints + algorithm to track topological changes.

* Generic computation of bulletin boards into geometric kernels
** keywords
- Bulletin board
- Topological entity modification
- Event follow-up mechanisms
- Generalized maps
** Contribution
"[…] a generic model allowing a bulletin board to be generated during a constructive
operation (i.e. sup- plied by the API of a geometric modeling system)."

* Push-Pull direct modeling of solid CAD models
** keywords
- Direct modeling
- Push-pull
- Solid modeling
- Validity
- Continuity
** Contribution
"[…] it has been discovered that a robust method for push-pull direct modeling
to consistently attain valid modeling results and continuous shape changes has
not been reached yet."

* Using virtual topology operations to generate analysis topology.
** keywords
- Virtual Topology
- Clean-Up
- Decomposition
- Hex meshing schemes
** Contribution
"Description of the topological queries required to generate the analysis
topology are provided for each virtual merge or split operation. Managing the
virtual and topological dependencies help maintain a valid topological
description […]"

* Adaptation of CAD model topology for finite element analysis (À voir)
** keywords
- CAD
- FEA
- FE model
- Topological data-structure
- Simplification criteria
- Topology editing operators
** Contribution
We provide a set of criteria that can be used to transform CAD model boundary
topology using MCT transformations, i.e., edge deletion, vertex deletion, edge
collapsing, and merging of vertices.

* A priori evaluation of simulation models preparation processes using artificial intelligence techniques (À voir)
* Blind Graph Topology Change Detection (À voir, pas dans mes compétences)
** keywords
- Detectors
- Topology
- Laplace equations
- Maximum likelihood estimation
- Tools
- Signal processing
- Diseases


* workflow
- repartir de l'état de l'art d'anais
- repérer statique ou dynamique
- détection événements ?
- cadre paramétrique ou autres
** comparaison
- commencer par le processus constructif
